#+title:      cripto-ejercicio-second-preimage
#+date:       [2025-11-12 mié 16:00]
#+filetags:   :cripto:diplomatura:famaf:
#+identifier: 20251112T160028

** Solución



#+begin_src python :results output :session cripto
from hashlib import sha256

target = b'alvarmaciel@gmail.com'
print(sha256(target).hexdigest()[:6])
expected = sha256(target).hexdigest()[:6]
message = b''
for i in range(0, (2**32)-1):
     test = target+i.to_bytes(4, 'big')
     if sha256(test).hexdigest()[:6] == expected:
         message = test    
         break
print(message)
print(sha256(message).hexdigest()[:6])
with open('message.bin', 'wb') as f:
    f.write(message)

#+end_src

#+RESULTS:
: 7ae248
: b'alvarmaciel@gmail.com\x00\x18\xf5b'
: 7ae248

#+begin_src python :results output :session cripto
import requests
url = 'https://ciberseguridad.diplomatura.unc.edu.ar/cripto/second-preimage/alvarmaciel@gmail.com/answer'
data = {'message': message}
print(message)
response = requests.post(url, files=data)
print(response.status_code)
print(response.text)
#+end_src

#+RESULTS:
: b'alvarmaciel@gmail.com\x00\x18\xf5b'
: 200
: ¡Ganaste!


